print("num 6:")
#Создание кортежа
mts = (12.5, 14.1, 9.8, 15.1, 11.2, 13.4, 10.0, 16.2)
print(f'Кортеж: {mts}')
#Вывод эл-тов
print(f'Первый - {mts[0]},'
      f'Последний - {mts[-1]}')
print(f'Срез первые 4: {mts[:4]}')
#Попытка изменить кортежа и демонстрация ошибки:
try:
    mts[0] = 99.9
except TypeError as e:
    print(f'Ошибка при попытке изменения эл-та: {e}, тк кортежи в Python неизменяемы')
#Распаковка первых 2-х значений:
v1, v2 = mts[0], mts[1]
print(f'Распакованны v1 = {v1} и v2 = {v2}')
#Преобразование в список, изменение и обратное преобразование
tl = list(mts)
tl[0] = 99.9
mts = tuple(tl)
print(f"Измененный кортеж через список:{mts}")



